app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @task = Task.find(id)

INSERT INTO "tasks" ("name", "description", "completion_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "More stuff"], ["description", "dgdfhjshfg"], ["completion_date", "Tuesday"], ["created_at", "2018-03-21 21:52:53.655792"], ["updated_at", "2018-03-21 21:52:53.655792"]]
---
    task = Task.new(task_params)
    if task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @task = Task.find_by(id:params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["completion_date", ""], ["description", "Study for weekly "], ["updated_at", "2018-03-22 21:55:46.132602"], ["id", 2]]
---
    task = Task.find_by(id:params[:id])
    if !task.nil?
      if task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 5]]
---
  def destroy
    id = params[:id]
    @task = Task.find(id)
    if @task
      @task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-03-24 16:18:39 -0700"], ["updated_at", "2018-03-24 23:18:39.025827"], ["id", 18]]
---
    task = Task.find_by(id:params[:id])
    task.completion_date = Time.now
    task.save